app/controllers/music_blogs_controller.rb

  def index
    @music_blogs = MusicBlog.all
---
SELECT "music_blogs".* FROM "music_blogs"

  def show
    @music_blog = MusicBlog.find(params[:id])
---
SELECT  "music_blogs".* FROM "music_blogs" WHERE "music_blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @music_blog = MusicBlog.find(params[:id])
---
SELECT  "music_blogs".* FROM "music_blogs" WHERE "music_blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @music_blog = MusicBlog.find(params[:id]) #look up specific post to edit
    if @music_blog.update music_blog_params #update post using form data
---
SELECT  "music_blogs".* FROM "music_blogs" WHERE "music_blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "music_blogs" SET "content" = ?, "updated_at" = ? WHERE "music_blogs"."id" = ?